[
  {
    "id": "2025-11-12-create-changelog",
    "releasedAt": "2025-11-12",
    "summary": "Introduced the in-app changelog",
    "details": "Created a bundled changelog data file and modal so players can review product updates from the account bar.",
    "type": "feature"
  },
  {
    "id": "2025-11-12-player-menu-widget",
    "releasedAt": "2025-11-12",
    "summary": "Introduced the expandable player menu",
    "details": "Refined the new account menu into a compact, file-menu inspired widget with role badges, uppercase player names, and a slim character/chronicle/location strip while keeping the changelog button separate.",
    "type": "feature"
  },
  {
    "id": "2025-11-12-chronicle-api-preflight",
    "releasedAt": "2025-11-12",
    "summary": "Restored chronicle list API calls",
    "details": "Hardened the Lambda handlers so API Gateway requests without the HTTP v2 metadata stop crashing, which restores the listCharacters and listChronicles player flows.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-12-ui-styling-refactor",
    "releasedAt": "2025-11-12",
    "summary": "Refined UI styling and menus",
    "details": "Collapsed the recent CSS refactors, player menu polish, character panel updates, and template shortcut tweaks into a single styling refresh that keeps the UI consistent.",
    "type": "improvement"
  },
  {
    "id": "2025-11-12-llm-audit-review",
    "releasedAt": "2025-11-12",
    "summary": "Added the moderator LLM audit review workspace",
    "details": "Moderators and admins can open the new LLM audit review page from the player menu to filter archived LLM requests, capture structured review notes, and inspect template improvement proposals.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-location-maintenance",
    "releasedAt": "2025-11-13",
    "summary": "Rolled out the moderator location maintenance workspace",
    "details": "Moderators and admins can open the Location Maintenance page from the player menu to browse the world graph, edit location metadata, and manage relationships via the location API without feature flags.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-llm-proxy-typed-client",
    "releasedAt": "2025-11-13",
    "summary": "Stabilized LLM proxy requests",
    "details": "Typed the chronicle API's LLM client against the proxy schema, added JSON coercion heuristics for fenced or double-encoded responses, and automatically retries the proxy when parsing still fails.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-13-gm-feedback",
    "releasedAt": "2025-11-13",
    "summary": "Players can react to GM stories",
    "details": "Added a Give Feedback button to GM replies so players can share a quick sentiment and note. Submissions piggyback on the audit API so moderators see feedback alongside narrative request logs.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-chronicle-wrap-toggle",
    "releasedAt": "2025-11-13",
    "summary": "Players can request chronicle endings",
    "details": "Added a Wrap Up toggle next to Send to GM that stores a chronicle targetEndTurn marker and updates the narrative prompting so the GM closes the story within three turns when requested.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-chronicle-closure-lock",
    "releasedAt": "2025-11-13",
    "summary": "Wrap-up turns now end chronicles",
    "details": "GM summaries now emit JSON with a closure signal, so once the story lands the chronicle flips to closed, the API blocks more turns, and the client disables Send/Wrap for that session.",
    "type": "improvement"
  },
  {
    "id": "2025-11-13-chronicle-beats",
    "releasedAt": "2025-11-13",
    "summary": "Chronicle beats anchor long-term goals",
    "details": "Chronicle creation now lets you enable beat tracking (on by default), the GM automatically seeds and resolves beats with title/description/status updates, and the client surfaces active beats under the navigation so players can see which story arcs are in progress.",
    "type": "feature"
  },
  {
    "id": "2025-11-14-chronicle-closer",
    "releasedAt": "2025-11-14",
    "summary": "Chronicle closures now generate epilogues",
    "details": "When a chronicle is closed we enqueue a new chronicle-closer Lambda that fabricates a short-story recap, high-level location events, and character bio notes via SQS so completed runs get preserved across the world state.",
    "type": "feature"
  },
  {
    "id": "2025-11-14-bug-moderation",
    "releasedAt": "2025-11-14",
    "summary": "Moderators can triage bug reports",
    "details": "Added a bug moderation workspace with a MUI data grid and modal so admins can review every bug report, capture backlog labels, add internal notes, and update the bug store status without leaving the client.",
    "type": "feature"
  },
  {
    "id": "2025-11-15-multi-intent-dag",
    "releasedAt": "2025-11-15",
    "summary": "GM turns now adapt to six intent styles",
    "details": "The narrative engine now classifies each player message as an action, inquiry, clarification, possibility check, planning beat, or reflection, branches through a new decision-graph, renders dedicated prompt templates, and only applies world deltas when the turn truly advances time. The chat UI now surfaces intent/timeline badges plus world-change traces so players can see how each response impacted the story.",
    "type": "feature"
  },
  {
    "id": "2025-11-16-intent-dag-upgrade",
    "releasedAt": "2025-11-16",
    "summary": "Intent DAG now uses dedicated classifiers",
    "details": "Split the router into intent, beat, and skill detector nodes that run gpt-5-nano through the revamped llmResolver, rewrote every prompt template (especially intent intake) to match the new DAG contracts, documented the node/parameter flow in apps/chronicle-api/src/langGraph/README.md, and migrated the llm proxy plus client to the OpenAI responses API with reasoning/text knobs so classifier nodes stay lean.",
    "type": "improvement"
  },
  {
    "id": "2025-11-16-chronicle-landing-ux",
    "releasedAt": "2025-11-16",
    "summary": "Landing briefs, player guide, and bug reporting",
    "details": "Added a briefing-style landing page with news, recent features, global chronicle signals, and a quick-continue panel so players see what's new before diving in. Chronicle chat now lives at /chron/:id with route-driven hydration, plus a new in-app player guide, live token-usage readout, and system bug report modal so players can find help or flag issues without leaving the client.",
    "type": "feature"
  },
  {
    "id": "2025-11-17-token-usage-widget",
    "releasedAt": "2025-11-17",
    "summary": "Player menu now shows LLM token usage",
    "details": "Wired the chronicle API Lambda to the LLM proxy's DynamoDB usage table and granted it read access, so the player menu widget can finally show per-login token consumption instead of an empty state. Also simplified the UI to a compact table with shorthand headers so the stats sit cleanly inside the player menu.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-20-gm-api-routing",
    "releasedAt": "2025-11-20",
    "summary": "GM API now handles player intents",
    "details": "Refactored the client’s send-and-wrap flows and updated the API Gateway/Lambda wiring so player turns now hit the dedicated gm-api while the chronicle service continues handling directory and setup endpoints.",
    "type": "improvement"
  },
  {
    "id": "2025-11-21-postgres-worldstate",
    "releasedAt": "2025-11-21",
    "summary": "Worldstate moved to Postgres",
    "details": "Replaced the hybrid S3/Dynamo persistence layer with a unified Postgres worldstate service, added a property-graph schema for chronicles, characters, turns, and locations, and wired the dev stack plus Terraform to provision and seed a shared RDS instance.",
    "type": "improvement"
  },
  {
    "id": "2025-11-22-player-identity-unified",
    "releasedAt": "2025-11-22",
    "summary": "Player identity replaces login everywhere",
    "details": "Removed the legacy login table and login identifiers across the stack, rewired DTOs, audits, persistence, APIs, and the client to use player IDs exclusively, and cleaned up front-end flows and tooling to stop mapping between login and player fields.",
    "type": "improvement"
  },
  {
    "id": "2025-11-23-postgres-persistence-consolidation",
    "releasedAt": "2025-11-23",
    "summary": "Retired the legacy persistence package",
    "details": "Moved prompt template, audit, and support data into the Postgres-backed stack, split bug reports and token usage into a dedicated ops module with its own migrations, removed the deprecated S3/Dynamo persistence layer (including the usage DynamoDB table), and pointed every API at the new canonical storage modules.",
    "type": "improvement"
  },
  {
    "id": "2025-11-24-app-schema-prompts",
    "releasedAt": "2025-11-24",
    "summary": "Prompt templates now live in the app schema",
    "details": "Introduced the @glass-frontier/app package with its own Postgres schema for players and prompt templates, seeded official template bodies via migrations, removed the S3 prompt bucket dependency, and rewired the APIs to resolve templates and player settings through the new Postgres-backed app store.",
    "type": "improvement"
  },
  {
    "id": "2025-11-25-character-jsonb-fields",
    "releasedAt": "2025-11-25",
    "summary": "Characters now persist full state in Postgres",
    "details": "Extended the worldstate character table to store archetype, pronouns, bio, attributes, skills, inventory, and momentum as jsonb fields so the Postgres-backed worldstate stays aligned with the Character DTO instead of only keeping name metadata.",
    "type": "improvement"
  },
  {
    "id": "2025-11-25-location-graph-slim",
    "releasedAt": "2025-11-25",
    "summary": "Location graph simplified onto Postgres edges",
    "details": "Rebuilt the location schema as a thin table plus graph edges with a single-parent constraint, removed the legacy location-root path columns, and rewired the worldstate location store to use recursive CTEs instead of the custom locationGraph store.",
    "type": "improvement"
  },
  {
    "id": "2025-11-26-gm-location-contract",
    "releasedAt": "2025-11-26",
    "summary": "GM API now targets the new location contract",
    "details": "Migrated the GM service to the new location contract by consuming the location details query, mapping it back to the existing UI shape, applying location moves through the canonical upsert/edge mutators, and exposing both legacy and new endpoints on the location API during the transition.",
    "type": "improvement"
  },
  {
    "id": "2025-11-27-location-relationship-fix",
    "releasedAt": "2025-11-27",
    "summary": "Location maintenance now returns proper relationships",
    "details": "Corrected the descendant query to preserve canonical parent ids in the location graph and added a Postgres-backed vitest suite that exercises location, edge, character, chronicle, and event persistence to prevent regressions.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-27-world-hardstate-lore",
    "releasedAt": "2025-11-27",
    "summary": "World hard state and lore fragments persist in Postgres",
    "details": "Seeded world kind/subkind/status and relationship rules from the shared world schema into Postgres, enforced typed hard-state links, and added lore fragment storage plus integration tests so narrative entities and their edges stay consistent.",
    "type": "feature"
  },
  {
    "id": "2025-11-27-world-schema-ui",
    "releasedAt": "2025-11-27",
    "summary": "World schema editor and API",
    "details": "Added a moderation page to manage world kinds, subkinds, statuses, and relationship rules, plus a dedicated world-schema API that surfaces the schema and allows updates backed by database constraints.",
    "type": "feature"
  },
  {
    "id": "2025-11-27-world-atlas-anchor-chronicle",
    "releasedAt": "2025-11-27",
    "summary": "World Atlas with anchored chronicles",
    "details": "Introduced the World Atlas wiki page for entities with editable hard state, relations, and lore, added anchor-aware chronicles via Atlas API, and exposed narrative anchor fragments to the GM prompts for better cohesion.",
    "type": "feature"
  },
  {
    "id": "2025-11-27-location-hardstate",
    "releasedAt": "2025-11-27",
    "summary": "Locations moved into world hard state",
    "details": "Removed the legacy location maintenance UI and API, now storing locations as world hard state entities via the Atlas flows. Chronicle start uses atlas locations and GM location calls are stubbed while the new flow replaces the old graph.",
    "type": "improvement"
  },
  {
    "id": "2025-11-27-lore-fragments-detached",
    "releasedAt": "2025-11-27",
    "summary": "Lore fragments can outlive chronicles",
    "details": "Chronicle IDs are now optional when creating lore fragments, and turn range metadata was removed so fragments can be authored from the UI or API and persist even if chronicles are deleted.",
    "type": "improvement"
  },
  {
    "id": "2025-11-27-hardstate-prominence",
    "releasedAt": "2025-11-27",
    "summary": "Hard state prominence levels",
    "details": "Hard state entities now carry a five-level prominence field (forgotten → mythic) with slug-based lookups, allowing filtering by prominence and slug-friendly Atlas/chronicle links.",
    "type": "feature"
  }
]
