[
  {
    "id": "2025-11-12-create-changelog",
    "releasedAt": "2025-11-12",
    "summary": "Introduced the in-app changelog",
    "details": "Created a bundled changelog data file and modal so players can review product updates from the account bar.",
    "type": "feature"
  },
  {
    "id": "2025-11-12-player-menu-widget",
    "releasedAt": "2025-11-12",
    "summary": "Introduced the expandable player menu",
    "details": "Refined the new account menu into a compact, file-menu inspired widget with role badges, uppercase player names, and a slim character/chronicle/location strip while keeping the changelog button separate.",
    "type": "feature"
  },
  {
    "id": "2025-11-12-chronicle-api-preflight",
    "releasedAt": "2025-11-12",
    "summary": "Restored chronicle list API calls",
    "details": "Hardened the Lambda handlers so API Gateway requests without the HTTP v2 metadata stop crashing, which restores the listCharacters and listChronicles player flows.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-12-ui-styling-refactor",
    "releasedAt": "2025-11-12",
    "summary": "Refined UI styling and menus",
    "details": "Collapsed the recent CSS refactors, player menu polish, character panel updates, and template shortcut tweaks into a single styling refresh that keeps the UI consistent.",
    "type": "improvement"
  },
  {
    "id": "2025-11-12-llm-audit-review",
    "releasedAt": "2025-11-12",
    "summary": "Added the moderator LLM audit review workspace",
    "details": "Moderators and admins can open the new LLM audit review page from the player menu to filter archived LLM requests, capture structured review notes, and inspect template improvement proposals.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-location-maintenance",
    "releasedAt": "2025-11-13",
    "summary": "Rolled out the moderator location maintenance workspace",
    "details": "Moderators and admins can open the Location Maintenance page from the player menu to browse the world graph, edit location metadata, and manage relationships via the location API without feature flags.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-llm-proxy-typed-client",
    "releasedAt": "2025-11-13",
    "summary": "Stabilized LLM proxy requests",
    "details": "Typed the chronicle API's LLM client against the proxy schema, added JSON coercion heuristics for fenced or double-encoded responses, and automatically retries the proxy when parsing still fails.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-13-gm-feedback",
    "releasedAt": "2025-11-13",
    "summary": "Players can react to GM stories",
    "details": "Added a Give Feedback button to GM replies so players can share a quick sentiment and note. Submissions piggyback on the audit API so moderators see feedback alongside narrative request logs.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-chronicle-wrap-toggle",
    "releasedAt": "2025-11-13",
    "summary": "Players can request chronicle endings",
    "details": "Added a Wrap Up toggle next to Send to GM that stores a chronicle targetEndTurn marker and updates the narrative prompting so the GM closes the story within three turns when requested.",
    "type": "feature"
  },
  {
    "id": "2025-11-13-chronicle-closure-lock",
    "releasedAt": "2025-11-13",
    "summary": "Wrap-up turns now end chronicles",
    "details": "GM summaries now emit JSON with a closure signal, so once the story lands the chronicle flips to closed, the API blocks more turns, and the client disables Send/Wrap for that session.",
    "type": "improvement"
  },
  {
    "id": "2025-11-13-chronicle-beats",
    "releasedAt": "2025-11-13",
    "summary": "Chronicle beats anchor long-term goals",
    "details": "Chronicle creation now lets you enable beat tracking (on by default), the GM automatically seeds and resolves beats with title/description/status updates, and the client surfaces active beats under the navigation so players can see which story arcs are in progress.",
    "type": "feature"
  },
  {
    "id": "2025-11-14-chronicle-closer",
    "releasedAt": "2025-11-14",
    "summary": "Chronicle closures now generate epilogues",
    "details": "When a chronicle is closed we enqueue a new chronicle-closer Lambda that fabricates a short-story recap, high-level location events, and character bio notes via SQS so completed runs get preserved across the world state.",
    "type": "feature"
  },
  {
    "id": "2025-11-14-bug-moderation",
    "releasedAt": "2025-11-14",
    "summary": "Moderators can triage bug reports",
    "details": "Added a bug moderation workspace with a MUI data grid and modal so admins can review every bug report, capture backlog labels, add internal notes, and update the bug store status without leaving the client.",
    "type": "feature"
  },
  {
    "id": "2025-11-15-multi-intent-dag",
    "releasedAt": "2025-11-15",
    "summary": "GM turns now adapt to six intent styles",
    "details": "The narrative engine now classifies each player message as an action, inquiry, clarification, possibility check, planning beat, or reflection, branches through a new decision-graph, renders dedicated prompt templates, and only applies world deltas when the turn truly advances time. The chat UI now surfaces intent/timeline badges plus world-change traces so players can see how each response impacted the story.",
    "type": "feature"
  },
  {
    "id": "2025-11-16-intent-dag-upgrade",
    "releasedAt": "2025-11-16",
    "summary": "Intent DAG now uses dedicated classifiers",
    "details": "Split the router into intent, beat, and skill detector nodes that run gpt-5-nano through the revamped llmResolver, rewrote every prompt template (especially intent intake) to match the new DAG contracts, documented the node/parameter flow in apps/chronicle-api/src/langGraph/README.md, and migrated the llm proxy plus client to the OpenAI responses API with reasoning/text knobs so classifier nodes stay lean.",
    "type": "improvement"
  },
  {
    "id": "2025-11-16-chronicle-landing-ux",
    "releasedAt": "2025-11-16",
    "summary": "Landing briefs, player guide, and bug reporting",
    "details": "Added a briefing-style landing page with news, recent features, global chronicle signals, and a quick-continue panel so players see what's new before diving in. Chronicle chat now lives at /chron/:id with route-driven hydration, plus a new in-app player guide, live token-usage readout, and system bug report modal so players can find help or flag issues without leaving the client.",
    "type": "feature"
  },
  {
    "id": "2025-11-17-token-usage-widget",
    "releasedAt": "2025-11-17",
    "summary": "Player menu now shows LLM token usage",
    "details": "Wired the chronicle API Lambda to the LLM proxy's DynamoDB usage table and granted it read access, so the player menu widget can finally show per-login token consumption instead of an empty state. Also simplified the UI to a compact table with shorthand headers so the stats sit cleanly inside the player menu.",
    "type": "bugfix"
  },
  {
    "id": "2025-11-18-playwright-isolated-stack",
    "releasedAt": "2025-11-18",
    "summary": "Playwright now boots a fully mocked stack",
    "details": "Added a dockerised LocalStack + WireMock harness, seeded the hybrid storage buckets/tables, and wired Playwright global setup to run the dev servers so we can run deterministic landing-page coverage without touching shared dev persistence or OpenAI.",
    "type": "improvement"
  },
  {
    "id": "2025-11-19-playwright-deltas-and-moderation",
    "releasedAt": "2025-11-19",
    "summary": "Playwright now validates deltas and moderator surfaces",
    "details": "Seeded richer location/inventory fixtures, scripted deterministic location-delta responses, and expanded the Playwright suite so it walks the GM pipeline, exercises multi-turn location plans, inspects character sheets, captures feedback/bug reports, and validates the LLM audit, bug moderation, and location maintenance workspaces end-to-end.",
    "type": "improvement"
  },
  {
    "id": "2025-11-20-gm-api-routing",
    "releasedAt": "2025-11-20",
    "summary": "GM API now handles player intents",
    "details": "Refactored the client’s send-and-wrap flows and updated the API Gateway/Lambda wiring so player turns now hit the dedicated gm-api while the chronicle service continues handling directory and setup endpoints.",
    "type": "improvement"
  },
  {
    "id": "2025-11-21-inventory-ui-simplification",
    "releasedAt": "2025-11-21",
    "summary": "Character inventory UI matches the new schema",
    "details": "Rebuilt the character overview so it renders gear, relics, consumables, and supplies straight from the new flat inventory payload, removed the obsolete gear queue/data shard hooks, and refreshed the inventory delta badge to show the new op kinds, descriptions, effects, and quantities.",
    "type": "improvement"
  },
  {
    "id": "2025-11-21-beat-tracker-highlights",
    "releasedAt": "2025-11-21",
    "summary": "Beat tracker badges explain GM goal shifts",
    "details": "Chat entries now read the beat tracker payload end-to-end: player intents show the focused beat next to the intent type, while GM replies use a compact badge with a tooltip that lists spawned beats and per-beat advances/resolutions.",
    "type": "improvement"
  }
]
